
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗарегистрироватьИзменения(Команда)
	ЗарегистрироватьИзмененияНаСервере(Элементы.Список.ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	Если ПредопределенныйУзел(Элемент.ТекущаяСтрока) Тогда
		Элементы.ЗарегистрироватьИзменения.Доступность = Ложь;
	Иначе
		Элементы.ЗарегистрироватьИзменения.Доступность = Истина;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервереБезКонтекста
Процедура ЗарегистрироватьИзмененияНаСервере(Узел)
	
	// Регистрация изменений всех данных для узла.
	ПланыОбмена.ЗарегистрироватьИзменения(Узел);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПредопределенныйУзел(Узел)
	Возврат Узел = ПланыОбмена.Филиалы.ЭтотУзел();
КонецФункции
#КонецОбласти

